# Pandas

In [1]:
import pandas as pd

* Series---1d array
*Data Frame --- 2d array (table formate, rows & column)

In [2]:
a=pd.Series([])
b=pd.Series([1,2,3,4,5,6,7])
c=pd.Series((33,44,55,66,77,88))
d=pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\vidit\AppData\Local\Temp\ipykernel_28784\332893695.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [3]:
print(type(a))
print(type(b))
print(type(c))
print(type(d))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [6]:
c

0    33
1    44
2    55
3    66
4    77
5    88
dtype: int64

In [7]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [8]:
print(d)

a    10
b    15
c    56
d    99
dtype: int64

In [9]:
a

Series([], dtype: float64)

In [10]:
import numpy as np

In [11]:
n=np.array([1,2,3,4,40])

In [14]:
x=pd.Series(n)

In [15]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [18]:
type(x)

pandas.core.series.Series

In [19]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [20]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [21]:
b[0]

1

In [23]:
b[2][:1]

[11]

In [24]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [25]:
d[3]

99

In [26]:
d['d']

99

In [27]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [28]:
s=pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [29]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [32]:
s=pd.Series([12,52,42,10,23],index=list('qwert'))

In [33]:
s2=pd.Series([34,56,34,45,65,13,60,99,45,45])

In [34]:
s2.value_counts()

45    3
34    2
56    1
65    1
13    1
60    1
99    1
dtype: int64

In [35]:
s2.argmax()

7

In [36]:
s.argmax()

1

In [39]:
s.argmax()

1

In [40]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [41]:
s.idxmax()

'w'

In [42]:
s.idxmin()

'r'

# Data frame

In [43]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,55,40,86])

In [44]:
a

Empty DataFrame
Columns: []
Index: []

In [45]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [46]:
type(b)

pandas.core.frame.DataFrame

In [48]:
c=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [49]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [50]:
d=pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[7,8,9,10,11],[2,4,6,8,1],[3,5,7,9,11]])

In [51]:
d

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3   2   4   6   8   1
4   3   5   7   9  11

In [52]:
d.head()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3   2   4   6   8   1
4   3   5   7   9  11

In [53]:
d.tail()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3   2   4   6   8   1
4   3   5   7   9  11

In [54]:
d.tail(2)

   0  1  2  3   4
3  2  4  6  8   1
4  3  5  7  9  11

In [55]:
c.sample()

   0  1  2
0  1  2  3

In [59]:
c.sample()

   0  1  2
0  1  2  3

In [60]:
d=pd.DataFrame([[1,2,3,4],[10,20,30,40],[7,8,9,10,11],[2,6,8,1],[3,5,9,11]])

In [61]:
d

    0   1   2   3     4
0   1   2   3   4   NaN
1  10  20  30  40   NaN
2   7   8   9  10  11.0
3   2   6   8   1   NaN
4   3   5   9  11   NaN

In [66]:
d=pd.DataFrame([[1,2,3,4,np.nan],[10,20,np.nan,30,40],[7,8,'missing',10,11],[2,np.nan,6,8,1],[3,5,9,11]])

In [63]:
d

    0     1    2   3     4
0   1   2.0  3.0   4   NaN
1  10  20.0  NaN  30  40.0
2   7   8.0  9.0  10  11.0
3   2   NaN  6.0   8   1.0
4   3   5.0  9.0  11   NaN

In [65]:
d

    0     1         2   3     4
0   1   2.0         3   4   NaN
1  10  20.0       NaN  30  40.0
2   7   8.0  missinng  10  11.0
3   2   NaN         6   8   1.0
4   3   5.0         9  11   NaN

In [67]:
d

    0     1        2   3     4
0   1   2.0        3   4   NaN
1  10  20.0      NaN  30  40.0
2   7   8.0  missing  10  11.0
3   2   NaN        6   8   1.0
4   3   5.0        9  11   NaN

In [69]:
d=pd.DataFrame([[1,2,3,4,np.nan],[10,20,np.nan,30,40],[7,8,'missing',10,11],[2,np.nan,6,8,1],[3,5,9,11]],index=['q','w','e','r','t'])

In [70]:
d

    0     1        2   3     4
q   1   2.0        3   4   NaN
w  10  20.0      NaN  30  40.0
e   7   8.0  missing  10  11.0
r   2   NaN        6   8   1.0
t   3   5.0        9  11   NaN

In [71]:
d=pd.DataFrame([[1,2,3,4,np.nan],[10,20,np.nan,30,40],[7,8,'missing',10,11],[2,np.nan,6,8,1],[3,5,9,11]],index=['q','w','e','r','t'],columns=['q','w','e','r','t'])

In [72]:
d

    q     w        e   r     t
q   1   2.0        3   4   NaN
w  10  20.0      NaN  30  40.0
e   7   8.0  missing  10  11.0
r   2   NaN        6   8   1.0
t   3   5.0        9  11   NaN

In [73]:
d['q']

q     1
w    10
e     7
r     2
t     3
Name: q, dtype: int64

In [74]:
d[['q','w']]

    q     w
q   1   2.0
w  10  20.0
e   7   8.0
r   2   NaN
t   3   5.0

In [79]:
d[['q','w']].head(3)

    q     w
q   1   2.0
w  10  20.0
e   7   8.0

In [77]:
d

    q     w        e   r     t
q   1   2.0        3   4   NaN
w  10  20.0      NaN  30  40.0
e   7   8.0  missing  10  11.0
r   2   NaN        6   8   1.0
t   3   5.0        9  11   NaN

In [81]:
d[['q','w']]['q':'e']

    q     w
q   1   2.0
w  10  20.0
e   7   8.0

In [83]:
d.shape

(5, 5)

In [96]:
d['w'].max()

20.0

In [88]:
d['x']=[12,13,14,15,16]

In [89]:
d

    q     w        e   r     t   x
q   1   2.0        3   4   NaN  12
w  10  20.0      NaN  30  40.0  13
e   7   8.0  missing  10  11.0  14
r   2   NaN        6   8   1.0  15
t   3   5.0        9  11   NaN  16

In [97]:
d['z']=d['q']+d['x']

In [98]:
d

    q     w        e   r     t   x   z
q   1   2.0        3   4   NaN  12  13
w  10  20.0      NaN  30  40.0  13  23
e   7   8.0  missing  10  11.0  14  21
r   2   NaN        6   8   1.0  15  17
t   3   5.0        9  11   NaN  16  19

In [102]:
f=d['q']>5

In [103]:
d[f]

    q     w        e   r     t   x   z
w  10  20.0      NaN  30  40.0  13  23
e   7   8.0  missing  10  11.0  14  21

In [104]:
d['q']>5

q    False
w     True
e     True
r    False
t    False
Name: q, dtype: bool